{
  "slug": "2025-11-21-guidance-rtfo-and-saf-mandate-feedstock-",
  "title": "Scottish Aviation Briefing – 2025-11-21",
  "wordCount": 238,
  "editorNotes": "Expand each section to ≥3,000 words total, embed at least four approved images, and ensure every factual statement cites the referenced source.",
  "sections": [
    {
      "heading": "Operational Snapshot",
      "content": "Daily digest of official releases touching Scottish and wider UK aviation activity:\n- **Guidance: RTFO and SAF Mandate feedstock materials used for creating low carbon fuels** — List of feedstock materials for making renewable fuels under the Renewable Transport Fuel Obligation (RTFO) scheme and Sustainable Aviation Fuel (SAF) mandate.\n- **New Sunderland-made Nissan LEAF qualifies for £3,750 discount under government’s EV grant in a boost for North East manufacturing** — There are now 39 models of electric vehicles eligible for the Electric Car Grant.\n- **Using a rental e-scooter** — How to safely use an electric scooter rented as part of a government trial.\n\n_Editors: verify figures/details against the primary sources linked below before expanding this section to the full narrative length._"
    },
    {
      "heading": "Technical & Industrial Notes",
      "content": "Summarise the engineering, basing, and procurement implications highlighted across today’s releases. Connect them to Scottish industrial capacity (Prestwick, Lossiemouth, Weir, Spirit AeroSystems) and quantify any fleet, workforce, or funding metrics disclosed. Cite the relevant MOD transparency tables where applicable."
    },
    {
      "heading": "Historical Context & Lessons",
      "content": "Relate the current developments back to Charles E. MacKay’s archival research—e.g., how modern readiness exercises echo WWII dispersal plans or how present-day logistics mirror Beardmore/Weir supply chains. Draw on verified passages from the corresponding book to reinforce continuity across decades."
    },
    {
      "heading": "Modern Legacy & Book Recommendation",
      "content": "Explain why this news matters for contemporary Scottish aviation readers, then steer them toward the recommended book for deeper study. Include a call-to-action linking to the relevant `/books/<id>` page and highlight unique research materials in the volume."
    }
  ],
  "images": [],
  "sourceReferences": [
    {
      "sourceId": "dft-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/deleted-rtfo-and-saf-mandate-feedstock-materials-used-for-creating-low-carbon-fuels",
      "citationText": "dft-press-office – Guidance: RTFO and SAF Mandate feedstock materials used for creating low carbon fuels"
    },
    {
      "sourceId": "dft-press-office",
      "sourceUrl": "https://www.gov.uk/government/news/new-sunderland-made-nissan-leaf-qualifies-for-3750-discount-under-governments-ev-grant-in-a-boost-for-north-east-manufacturing",
      "citationText": "dft-press-office – New Sunderland-made Nissan LEAF qualifies for £3,750 discount under government’s EV grant in a boost for North East manufacturing"
    },
    {
      "sourceId": "dft-press-office",
      "sourceUrl": "https://www.gov.uk/guidance/e-scooter-trials-guidance-for-users",
      "citationText": "dft-press-office – Using a rental e-scooter"
    }
  ],
  "relatedBooks": [
    {
      "bookId": "this-was-the-enemy-volume-two",
      "reason": "Topical link between news items and catalogue research focus."
    }
  ],
  "keywords": [
    {
      "keyword": "Scottish aviation news",
      "primary": true
    },
    {
      "keyword": "Royal Air Force updates",
      "primary": false
    },
    {
      "keyword": "Scottish aerospace industry",
      "primary": false
    }
  ],
  "status": "published",
  "createdAt": "2025-11-21T21:08:55.960Z"
}
