{
  "slug": "2025-11-21-defence-secretary-speech-on-threats-to-t",
  "title": "Scottish Aviation Briefing – 2025-11-21",
  "wordCount": 260,
  "editorNotes": "Expand each section to ≥3,000 words total, embed at least four approved images, and ensure every factual statement cites the referenced source.",
  "sections": [
    {
      "heading": "Operational Snapshot",
      "content": "Daily digest of official releases touching Scottish and wider UK aviation activity:\n- **Defence Secretary speech on threats to the UK** — The Defence Secretary set out the scale of threats we face, including from the Russian spy ship Yantar which was threatening UK waters between 5 and 11 November.\n- **First ever government female veterans’ forum to put ex-military voices at the heart of support** — Female veterans are to be put at the heart of government support, through a new women veterans forum announced today.\n- **easyJet launches new Inverness–Birmingham route for March 2026** — Inverness Airport is thrilled to share that easyJet has announced a new direct service between Inverness and Birmingham, bringing back a route that passengers have requested in recent years.\n\n_Editors: verify figures/details against the primary sources linked below before expanding this section to the full narrative length._"
    },
    {
      "heading": "Technical & Industrial Notes",
      "content": "Summarise the engineering, basing, and procurement implications highlighted across today’s releases. Connect them to Scottish industrial capacity (Prestwick, Lossiemouth, Weir, Spirit AeroSystems) and quantify any fleet, workforce, or funding metrics disclosed. Cite the relevant MOD transparency tables where applicable."
    },
    {
      "heading": "Historical Context & Lessons",
      "content": "Relate the current developments back to Charles E. MacKay’s archival research—e.g., how modern readiness exercises echo WWII dispersal plans or how present-day logistics mirror Beardmore/Weir supply chains. Draw on verified passages from the corresponding book to reinforce continuity across decades."
    },
    {
      "heading": "Modern Legacy & Book Recommendation",
      "content": "Explain why this news matters for contemporary Scottish aviation readers, then steer them toward the recommended book for deeper study. Include a call-to-action linking to the relevant `/books/<id>` page and highlight unique research materials in the volume."
    }
  ],
  "images": [],
  "sourceReferences": [
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/speeches/defence-secretary-speech-on-threats-to-the-uk",
      "citationText": "mod-press-office – Defence Secretary speech on threats to the UK"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/news/first-ever-government-female-veterans-forum-to-put-ex-military-voices-at-the-heart-of-support",
      "citationText": "mod-press-office – First ever government female veterans’ forum to put ex-military voices at the heart of support"
    },
    {
      "sourceId": "hial-airports",
      "sourceUrl": "https://www.hial.co.uk/news/article/220/easyjet-launches-new-inverness-birmingham-route-for-march-2026",
      "citationText": "hial-airports – easyJet launches new Inverness–Birmingham route for March 2026"
    }
  ],
  "relatedBooks": [
    {
      "bookId": "this-was-the-enemy-volume-two",
      "reason": "Topical link between news items and catalogue research focus."
    }
  ],
  "keywords": [
    {
      "keyword": "Scottish aviation news",
      "primary": true
    },
    {
      "keyword": "Royal Air Force updates",
      "primary": false
    },
    {
      "keyword": "Scottish aerospace industry",
      "primary": false
    }
  ],
  "status": "draft",
  "createdAt": "2025-11-21T21:08:13.624Z"
}
