{
  "slug": "2025-11-21-uk-launches-military-esports-games-to-bo",
  "title": "Scottish Aviation Briefing – 2025-11-21",
  "wordCount": 239,
  "editorNotes": "Expand each section to ≥3,000 words total, embed at least four approved images, and ensure every factual statement cites the referenced source.",
  "sections": [
    {
      "heading": "Operational Snapshot",
      "content": "Daily digest of official releases touching Scottish and wider UK aviation activity:\n- **UK launches military esports games to boost cyber skills** — Military personnel from over 40 nations compete to sharpen cyber skills through gaming applying lessons from Ukraine's use of gaming technology in warfare.\n- **Gurkhas lay to rest unknown war hero** — The poignant burial of an unknown soldier of World War 2 took place today in Arezzo, Italy, with a bearer party from the Gurkhas carrying him to his final resting place.\n- **Transparency data: MOD: workforce management information January to December 2025** — Reports on departmental staff numbers and costs.\n\n_Editors: verify figures/details against the primary sources linked below before expanding this section to the full narrative length._"
    },
    {
      "heading": "Technical & Industrial Notes",
      "content": "Summarise the engineering, basing, and procurement implications highlighted across today’s releases. Connect them to Scottish industrial capacity (Prestwick, Lossiemouth, Weir, Spirit AeroSystems) and quantify any fleet, workforce, or funding metrics disclosed. Cite the relevant MOD transparency tables where applicable."
    },
    {
      "heading": "Historical Context & Lessons",
      "content": "Relate the current developments back to Charles E. MacKay’s archival research—e.g., how modern readiness exercises echo WWII dispersal plans or how present-day logistics mirror Beardmore/Weir supply chains. Draw on verified passages from the corresponding book to reinforce continuity across decades."
    },
    {
      "heading": "Modern Legacy & Book Recommendation",
      "content": "Explain why this news matters for contemporary Scottish aviation readers, then steer them toward the recommended book for deeper study. Include a call-to-action linking to the relevant `/books/<id>` page and highlight unique research materials in the volume."
    }
  ],
  "images": [],
  "sourceReferences": [
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/news/uk-launches-military-esports-games-to-boost-cyber-skills",
      "citationText": "mod-press-office – UK launches military esports games to boost cyber skills"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/news/gurkhas-lay-to-rest-unknown-war-hero",
      "citationText": "mod-press-office – Gurkhas lay to rest unknown war hero"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/mod-workforce-management-information-january-to-december-2025",
      "citationText": "mod-press-office – Transparency data: MOD: workforce management information January to December 2025"
    }
  ],
  "relatedBooks": [
    {
      "bookId": "this-was-the-enemy-volume-two",
      "reason": "Topical link between news items and catalogue research focus."
    }
  ],
  "keywords": [
    {
      "keyword": "Scottish aviation news",
      "primary": true
    },
    {
      "keyword": "Royal Air Force updates",
      "primary": false
    },
    {
      "keyword": "Scottish aerospace industry",
      "primary": false
    }
  ],
  "status": "published",
  "createdAt": "2025-11-21T17:59:25.291Z"
}
