{
  "slug": "2025-11-21-transparency-data-military-court-service",
  "title": "Scottish Aviation Briefing – 2025-11-21",
  "wordCount": 223,
  "editorNotes": "Expand each section to ≥3,000 words total, embed at least four approved images, and ensure every factual statement cites the referenced source.",
  "sections": [
    {
      "heading": "Operational Snapshot",
      "content": "Daily digest of official releases touching Scottish and wider UK aviation activity:\n- **Transparency data: Military Court Service sentencing remarks 2025** — Transcripts of sentencing remarks from Service Court hearings in the Court Martial from 2025.\n- **Official Statistics: MOD Diversity Dashboard: October 2025** — Statistics on the diversity declaration and representation of minority groups of civil servants employed by the MOD.\n- **Guidance: Military low flying: RAF operational low flying training timetable** — Royal Air Force (RAF) operational low flying training timetables in 3 areas of the UK.\n\n_Editors: verify figures/details against the primary sources linked below before expanding this section to the full narrative length._"
    },
    {
      "heading": "Technical & Industrial Notes",
      "content": "Summarise the engineering, basing, and procurement implications highlighted across today’s releases. Connect them to Scottish industrial capacity (Prestwick, Lossiemouth, Weir, Spirit AeroSystems) and quantify any fleet, workforce, or funding metrics disclosed. Cite the relevant MOD transparency tables where applicable."
    },
    {
      "heading": "Historical Context & Lessons",
      "content": "Relate the current developments back to Charles E. MacKay’s archival research—e.g., how modern readiness exercises echo WWII dispersal plans or how present-day logistics mirror Beardmore/Weir supply chains. Draw on verified passages from the corresponding book to reinforce continuity across decades."
    },
    {
      "heading": "Modern Legacy & Book Recommendation",
      "content": "Explain why this news matters for contemporary Scottish aviation readers, then steer them toward the recommended book for deeper study. Include a call-to-action linking to the relevant `/books/<id>` page and highlight unique research materials in the volume."
    }
  ],
  "images": [],
  "sourceReferences": [
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/military-court-service-sentencing-remarks-2025",
      "citationText": "mod-press-office – Transparency data: Military Court Service sentencing remarks 2025"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/statistics/mod-diversity-dashboard-october-2025",
      "citationText": "mod-press-office – Official Statistics: MOD Diversity Dashboard: October 2025"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/operational-low-flying-training-timetable",
      "citationText": "mod-press-office – Guidance: Military low flying: RAF operational low flying training timetable"
    }
  ],
  "relatedBooks": [
    {
      "bookId": "sabres-from-north",
      "reason": "Topical link between news items and catalogue research focus."
    }
  ],
  "keywords": [
    {
      "keyword": "Scottish aviation news",
      "primary": true
    },
    {
      "keyword": "Royal Air Force updates",
      "primary": false
    },
    {
      "keyword": "Scottish aerospace industry",
      "primary": false
    }
  ],
  "status": "draft",
  "createdAt": "2025-11-21T21:08:03.723Z"
}
