{
  "slug": "2025-11-21-regulation-manual-of-airworthiness-maint",
  "title": "Scottish Aviation Briefing – 2025-11-21",
  "wordCount": 207,
  "editorNotes": "Expand each section to ≥3,000 words total, embed at least four approved images, and ensure every factual statement cites the referenced source.",
  "sections": [
    {
      "heading": "Operational Snapshot",
      "content": "Daily digest of official releases touching Scottish and wider UK aviation activity:\n- **Regulation: Manual of Airworthiness Maintenance – Documentation (MAM-D)** — The MAM-D is a comprehensive list of Defence Aviation Environment engineering documentation, processes and Instructions for Use.\n- **100 new jobs created as drone factory opens in Swindon** — Factory will build next-generation uncrewed systems and loitering munitions.\n- **Guidance: Chickerell firing times** — Warning notice of firing at Chickerell range.\n\n_Editors: verify figures/details against the primary sources linked below before expanding this section to the full narrative length._"
    },
    {
      "heading": "Technical & Industrial Notes",
      "content": "Summarise the engineering, basing, and procurement implications highlighted across today’s releases. Connect them to Scottish industrial capacity (Prestwick, Lossiemouth, Weir, Spirit AeroSystems) and quantify any fleet, workforce, or funding metrics disclosed. Cite the relevant MOD transparency tables where applicable."
    },
    {
      "heading": "Historical Context & Lessons",
      "content": "Relate the current developments back to Charles E. MacKay’s archival research—e.g., how modern readiness exercises echo WWII dispersal plans or how present-day logistics mirror Beardmore/Weir supply chains. Draw on verified passages from the corresponding book to reinforce continuity across decades."
    },
    {
      "heading": "Modern Legacy & Book Recommendation",
      "content": "Explain why this news matters for contemporary Scottish aviation readers, then steer them toward the recommended book for deeper study. Include a call-to-action linking to the relevant `/books/<id>` page and highlight unique research materials in the volume."
    }
  ],
  "images": [],
  "sourceReferences": [
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/manual-of-airworthiness-maintenance-documentation-mam-d",
      "citationText": "mod-press-office – Regulation: Manual of Airworthiness Maintenance – Documentation (MAM-D)"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/news/100-new-jobs-created-as-drone-factory-opens-in-swindon",
      "citationText": "mod-press-office – 100 new jobs created as drone factory opens in Swindon"
    },
    {
      "sourceId": "mod-press-office",
      "sourceUrl": "https://www.gov.uk/government/publications/chickerell-firing-times",
      "citationText": "mod-press-office – Guidance: Chickerell firing times"
    }
  ],
  "relatedBooks": [
    {
      "bookId": "this-was-the-enemy-volume-two",
      "reason": "Topical link between news items and catalogue research focus."
    }
  ],
  "keywords": [
    {
      "keyword": "Scottish aviation news",
      "primary": true
    },
    {
      "keyword": "Royal Air Force updates",
      "primary": false
    },
    {
      "keyword": "Scottish aerospace industry",
      "primary": false
    }
  ],
  "status": "draft",
  "createdAt": "2025-11-21T19:47:27.661Z"
}
